{
	"total_hits": 1454,
	"total_pages": 49,
	"current_page": 1,
	"suggestion": "",
	"search_time": 555,
	"results": [
		{
			"id": "16547",
			"title": "Functional square root",
			"url": "https://en.wikipedia.org/wiki/Functional_square_root",
			"abs": "Functional square root In mathematics a functional square root sometimes called a half iterate is a square root of a function with respect to the operation of function composition In other words a functional square root of a function is a function satisfying for all Notation Notations expressing that is a functional square root of are and History The functional square root of the exponential function now known as a halfexponential function was studied by Hellmuth Kneser in T",
			"highlight": "Functional <strong>square</strong> <strong>root</strong> In mathematics, a functional <strong>square</strong> <strong>root</strong> (sometimes called a half iterate) is a <strong>square</strong> <strong>root</strong> of a function with respect to the operation of function composition. In other words, a functional <strong>square</strong> <strong>root</strong> of a function is a function satisfying for all . Notation Notations expressing that is a functional <strong>square</strong> <strong>root</strong> of are and . History The functional <strong>square</strong> <strong>root</strong> of the exponential function (now known as a half-exponential function) was studied by Hellmuth Kneser in 1950.[1] T",
			"reading_time": 1,
			"date_creation": "2020-01-28",
			"isFavorite": false
		},
		{
			"id": "12380",
			"title": "Square root of a matrix",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_a_matrix",
			"abs": "Square root of a matrix In mathematics the square root of a matrix extends the notion of square root from numbers to matrices A matrix is said to be a square root of if the matrix product is equal to Some authors use the name square root or the notation only for the specific case when is positive semidefinite to denote the unique matrix that is positive semidefinite and such that for realvalued matrices where is the transpose of Less frequently the name square root may be used for",
			"highlight": "<strong>Square</strong> <strong>root</strong> of a matrix In mathematics, the <strong>square</strong> <strong>root</strong> of a matrix extends the notion of <strong>square</strong> <strong>root</strong> from numbers to matrices. A matrix is said to be a <strong>square</strong> <strong>root</strong> of if the matrix product is equal to .[1] Some authors use the name <strong>square</strong> <strong>root</strong> or the notation only for the specific case when is positive semidefinite, to denote the unique matrix that is positive semidefinite and such that (for real-valued matrices, where is the transpose of ). Less frequently, the name <strong>square</strong> <strong>root</strong> may be used for",
			"reading_time": 2,
			"date_creation": "2020-07-05",
			"isFavorite": true
		},
		{
			"id": "1066",
			"title": "Square root",
			"url": "https://en.wikipedia.org/wiki/Square_root",
			"abs": "Notation for the principal square root of For example since or squared In mathematics a square root of a number is a number such that in other words a number whose square the result of multiplying the number by itself or is For example and are square roots of because Every nonnegative real number has a unique nonnegative square root called the principal square root which is denoted by sqrtx where the symbol sqrt is c",
			"highlight": "Notation for the (principal) <strong>square</strong> <strong>root</strong> of . For example, , since , or (5 <strong>squared</strong>). In mathematics, a <strong>square</strong> <strong>root</strong> of a number is a number such that ; in other words, a number whose <strong>square</strong> (the result of multiplying the number by itself, or  ⋅ ) is .[1] For example, 4 and −4 are <strong>square</strong> <strong>roots</strong> of 16, because . Every nonnegative real number has a unique nonnegative <strong>square</strong> <strong>root</strong>, called the principal <strong>square</strong> <strong>root</strong>, which is denoted by <som1>\\sqrt{x},</som1> where the symbol <som2>\\sqrt{~^~}</som2> is c",
			"reading_time": 15,
			"date_creation": "2014-01-28",
			"isFavorite": true
		},
		{
			"id": "36486",
			"title": "Square root of 6",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_6",
			"abs": "Square root of Rectangles of area including x and x solid black and a square of side geometric mean of and or square root of red dashed plus a square of side arithmetic mean of and black dotted with area The double cube has distances between corners including corners of the included two cubes equal to the square roots of the first six natural numbers up to the square root of The square root of is the positive real number that when multiplied by itself g",
			"highlight": "<strong>Square</strong> <strong>root</strong> of 6 Rectangles of area 6, including 2x3 and 3x2 (solid black), and a <strong>square</strong> of side geometric mean of 2 and 3, or <strong>square</strong> <strong>root</strong> of 6 (red dashed); plus a <strong>square</strong> of side arithmetic mean of 2 and 3 (black dotted) with area 6.25 The double cube has distances between corners (including corners of the included two cubes) equal to the <strong>square</strong> <strong>roots</strong> of the first six natural numbers, up to the <strong>square</strong> <strong>root</strong> of 6. The <strong>square</strong> <strong>root</strong> of 6 is the positive real number that, when multiplied by itself, g",
			"reading_time": 10,
			"date_creation": "2014-02-12",
			"isFavorite": false
		},
		{
			"id": "29391",
			"title": "Square root of a 2 by 2 matrix",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_a_2_by_2_matrix",
			"abs": "Square root of a by matrix A square root of a matrix M is another matrix R such that M R where R stands for the matrix product of R with itself In general there can be zero two four or even an infinitude of squareroot matrices In many cases such a matrix R can be obtained by an explicit formula Square roots that are not the allzeros matrix come in pairs if R is a square root of M then R is also a square root of M since RR RR R M A matrix",
			"highlight": "<strong>Square</strong> <strong>root</strong> of a 2 by 2 matrix A <strong>square</strong> <strong>root</strong> of a 2×2 matrix M is another 2×2 matrix R such that M = R2, where R2 stands for the matrix product of R with itself. In general, there can be zero, two, four, or even an infinitude of <strong>square</strong>-<strong>root</strong> matrices. In many cases, such a matrix R can be obtained by an explicit formula. <strong>Square</strong> <strong>roots</strong> that are not the all-zeros matrix come in pairs: if R is a <strong>square</strong> <strong>root</strong> of M, then −R is also a <strong>square</strong> <strong>root</strong> of M, since (−R)(−R) = (−1)(−1)(RR) = R2 = M. A 2×2 matrix",
			"reading_time": 6,
			"date_creation": "2011-05-21",
			"isFavorite": false
		},
		{
			"id": "17406",
			"title": "Root-mean-square deviation",
			"url": "https://en.wikipedia.org/wiki/Root-mean-square_deviation",
			"abs": "Rootmeansquare deviation The rootmeansquare deviation RMSD or rootmeansquare error RMSE is a frequently used measure of the differences between values sample or population values predicted by a model or an estimator and the values observed The RMSD represents the square root of the second sample moment of the differences between predicted values and observed values or the quadratic mean of these differences These deviations are called residuals when the calculations are performed o",
			"highlight": "<strong>Root</strong>-mean-<strong>square</strong> deviation The <strong>root</strong>-mean-<strong>square</strong> deviation (RMSD) or <strong>root</strong>-mean-<strong>square</strong> error (RMSE) is a frequently used measure of the differences between values (sample or population values) predicted by a model or an estimator and the values observed. The RMSD represents the <strong>square</strong> <strong>root</strong> of the second sample moment of the differences between predicted values and observed values or the quadratic mean of these differences. These deviations are called residuals when the calculations are performed o",
			"reading_time": 7,
			"date_creation": "2014-12-31",
			"isFavorite": false
		},
		{
			"id": "30239",
			"title": "Square sign",
			"url": "https://en.wikipedia.org/wiki/Square_sign",
			"abs": "Square sign may refer to The number sign The radical symbol sqrt or used for square root or its precomposed form with a number such as the Unicode characters for the cube root and the fourth root and Any squareshaped symbol including many geometrically shaped Unicode characters",
			"highlight": "<strong>Square</strong> sign may refer to: The number sign # The radical symbol <som1>\\sqrt{\\,\\,}</som1> or √ used for <strong>square</strong> <strong>root</strong>, or its precomposed form with a number, such as the Unicode characters for the cube <strong>root</strong> and the fourth <strong>root</strong>, ∛ and ∜ Any <strong>square</strong>-shaped symbol, including many geometrically shaped Unicode characters",
			"reading_time": 6,
			"date_creation": "2013-03-20",
			"isFavorite": false
		},
		{
			"id": "17645",
			"title": "Square root of 3",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_3",
			"abs": "Square root of The square root of is the positive real number that when multiplied by itself gives the number It is denoted mathematically as or It is more precisely called the principal square root of to distinguish it from the negative number with the same property The square root of is an irrational number It is also known as Theodorus constant after Theodorus of Cyrene who proved its irrationality As of December its numerical value in decimal notation had been",
			"highlight": "<strong>Square</strong> <strong>root</strong> of 3 The <strong>square</strong> <strong>root</strong> of 3 is the positive real number that, when multiplied by itself, gives the number 3. It is denoted mathematically as or 31/2. It is more precisely called the principal <strong>square</strong> <strong>root</strong> of 3, to distinguish it from the negative number with the same property. The <strong>square</strong> <strong>root</strong> of 3 is an irrational number. It is also known as Theodorus' constant, after Theodorus of Cyrene, who proved its irrationality. As of December 2013, its numerical value in decimal notation had been",
			"reading_time": 9,
			"date_creation": "2021-08-14",
			"isFavorite": false
		},
		{
			"id": "26789",
			"title": "Radical symbol",
			"url": "https://en.wikipedia.org/wiki/Radical_symbol",
			"abs": "Radical symbol In mathematics the radical sign radical symbol root symbol radix or surd is a symbol for the square root or higherorder root of a number The square root of a number x is written as sqrtx while the nth root of x is written as sqrtnx It is also used for other meanings in more advanced mathematics such as the radical of an ideal In linguistics the symbol is used to denote a root word Principal squar",
			"highlight": "Radical symbol In mathematics, the radical sign, radical symbol, <strong>root</strong> symbol, radix, or surd is a symbol for the <strong>square</strong> <strong>root</strong> or higher-order <strong>root</strong> of a number. The <strong>square</strong> <strong>root</strong> of a number <som1>x</som1> is written as <som2>\\sqrt{x},</som2> while the <som3>n</som3>th <strong>root</strong> of <som1>x</som1> is written as <som4>\\sqrt[n]{x}.</som4> It is also used for other meanings in more advanced mathematics, such as the radical of an ideal. In linguistics, the symbol is used to denote a <strong>root</strong> word. Principal <strong>squar</strong>",
			"reading_time": 11,
			"date_creation": "2015-04-20",
			"isFavorite": false
		},
		{
			"id": "2098",
			"title": "Root mean square",
			"url": "https://en.wikipedia.org/wiki/Root_mean_square",
			"abs": "Root mean square In mathematics and its applications the root mean square RMS or or rms is defined as the square root of the mean square the arithmetic mean of the squares of a set of numbers The RMS is also known as the quadratic mean and is a particular case of the generalized mean with exponent RMS can also be defined for a continuously varying function in terms of an integral of the squares of the instantaneous values during a cycle For alternating electric current RMS is",
			"highlight": "<strong>Root</strong> mean <strong>square</strong> In mathematics and its applications, the <strong>root</strong> mean <strong>square</strong> (RMS or or rms) is defined as the <strong>square</strong> <strong>root</strong> of the mean <strong>square</strong> (the arithmetic mean of the <strong>squares</strong> of a set of numbers).[1] The RMS is also known as the quadratic mean[2][3] and is a particular case of the generalized mean with exponent 2. RMS can also be defined for a continuously varying function in terms of an integral of the <strong>squares</strong> of the instantaneous values during a cycle. For alternating electric current, RMS is",
			"reading_time": 3,
			"date_creation": "2010-08-03",
			"isFavorite": false
		},
		{
			"id": "3535",
			"title": "Nth root",
			"url": "https://en.wikipedia.org/wiki/Nth_root",
			"abs": "Nth root In mathematics an nth root of a number x is a number r which when raised to the power n yields x rn x where n is a positive integer sometimes called the degree of the root A root of degree is called a square root and a root of degree a cube root Roots of higher degree are referred by using ordinal numbers as in fourth root twentieth root etc The computation of an th root is a root extraction For example is a square root of since and is a",
			"highlight": "Nth <strong>root</strong> In mathematics, an nth <strong>root</strong> of a number x is a number r which, when raised to the power n, yields x: <som1>r^n = x,</som1> where n is a positive integer, sometimes called the degree of the <strong>root</strong>. A <strong>root</strong> of degree 2 is called a <strong>square</strong> <strong>root</strong> and a <strong>root</strong> of degree 3, a cube <strong>root</strong>. <strong>Roots</strong> of higher degree are referred by using ordinal numbers, as in fourth <strong>root</strong>, twentieth <strong>root</strong>, etc. The computation of an th <strong>root</strong> is a <strong>root</strong> extraction. For example, 3 is a <strong>square</strong> <strong>root</strong> of 9, since 3 = 9, and −3 is a",
			"reading_time": 2,
			"date_creation": "2016-12-04",
			"isFavorite": false
		},
		{
			"id": "38014",
			"title": "Square root of 7",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_7",
			"abs": "Square root of The rectangle that bounds an equialateral triangle of side or a regular hexagon of side has a diagonal of square root of A Logarex system Darmstadt slide rule with and on A and B scales and square roots of and of on C and D scales which can be read as slightly less than and somewhat more than respectively The square root of is the positive real number that when multiplied by itself gives the prime number It is more precisely called the princi",
			"highlight": "<strong>Square</strong> <strong>root</strong> of 7 The rectangle that bounds an equialateral triangle of side 2, or a regular hexagon of side 1, has a diagonal of <strong>square</strong> <strong>root</strong> of 7. A Logarex system Darmstadt slide rule with 7 and 6 on A and B scales, and <strong>square</strong> <strong>roots</strong> of 6 and of 7 on C and D scales, which can be read as slightly less than 2.45 and somewhat more than 2.64, respectively The <strong>square</strong> <strong>root</strong> of 7 is the positive real number that, when multiplied by itself, gives the prime number 7. It is more precisely called the princi",
			"reading_time": 2,
			"date_creation": "2015-05-01",
			"isFavorite": false
		},
		{
			"id": "14159",
			"title": "Root-mean-square deviation of atomic positions",
			"url": "https://en.wikipedia.org/wiki/Root-mean-square_deviation_of_atomic_positions",
			"abs": "Rootmeansquare deviation of atomic positions In bioinformatics the rootmeansquare deviation of atomic positions or simply rootmeansquare deviation RMSD is the measure of the average distance between the atoms usually the backbone atoms of superimposed proteins Note that RMSD calculation can be applied to other nonprotein molecules such as small organic molecules In the study of globular protein conformations one customarily measures the similarity in threedimensional struc",
			"highlight": "<strong>Root</strong>-mean-<strong>square</strong> deviation of atomic positions In bioinformatics, the <strong>root</strong>-mean-<strong>square</strong> deviation of atomic positions, or simply <strong>root</strong>-mean-<strong>square</strong> deviation (RMSD), is the measure of the average distance between the atoms (usually the backbone atoms) of superimposed proteins. Note that RMSD calculation can be applied to other, non-protein molecules, such as small organic molecules.[1] In the study of globular protein conformations, one customarily measures the similarity in three-dimensional struc",
			"reading_time": 12,
			"date_creation": "2020-04-05",
			"isFavorite": false
		},
		{
			"id": "4506",
			"title": "Square root of 2",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_2",
			"abs": "The square root of approximately is a positive real number that when multiplied by itself equals the number It may be written in mathematics as sqrt or and is an algebraic number Technically it should be called the principal square root of to distinguish it from the negative number with the same property Geometrically the square root of is the length of a diagonal across a square with sides of one unit of length this follows fro",
			"highlight": "The <strong>square</strong> <strong>root</strong> of 2 (approximately 1.4142) is a positive real number that, when multiplied by itself, equals the number 2. It may be written in mathematics as <som1>\\sqrt{2}</som1> or <som2>2^{1/2}</som2>, and is an algebraic number. Technically, it should be called the principal <strong>square</strong> <strong>root</strong> of 2, to distinguish it from the negative number with the same property. Geometrically, the <strong>square</strong> <strong>root</strong> of 2 is the length of a diagonal across a <strong>square</strong> with sides of one unit of length;[1] this follows fro",
			"reading_time": 6,
			"date_creation": "2015-02-17",
			"isFavorite": false
		},
		{
			"id": "25331",
			"title": "Fast inverse square root",
			"url": "https://en.wikipedia.org/wiki/Fast_inverse_square_root",
			"abs": "Lighting and reflection calculations shown here in the firstperson shooter OpenArena use the fast inverse square root code to compute angles of incidence and reflection Fast inverse square root sometimes referred to as Fast InvSqrt or by the hexadecimal constant xFDF is an algorithm that estimates fracsqrtx the reciprocal or multiplicative inverse of the square root of a bit floatingpoint number x in IEEE floatingpoint format This ope",
			"highlight": "Lighting and reflection calculations (shown here in the first-person shooter OpenArena) use the fast inverse <strong>square</strong> <strong>root</strong> code to compute angles of incidence and reflection. Fast inverse <strong>square</strong> <strong>root</strong>, sometimes referred to as Fast InvSqrt() or by the hexadecimal constant 0x5F3759DF, is an algorithm that estimates <som1>\\frac{1}{\\sqrt{x}}</som1>, the reciprocal (or multiplicative inverse) of the <strong>square</strong> <strong>root</strong> of a 32-bit floating-point number <som2>x</som2> in IEEE 754 floating-point format. This ope",
			"reading_time": 4,
			"date_creation": "2020-08-24",
			"isFavorite": false
		},
		{
			"id": "13733",
			"title": "Square-free polynomial",
			"url": "https://en.wikipedia.org/wiki/Square-free_polynomial",
			"abs": "Squarefree polynomial In mathematics a squarefree polynomial is a polynomial defined over a field or more generally an integral domain that does not have as a divisor any square of a nonconstant polynomial A univariate polynomial is square free if and only if it has no multiple root in an algebraically closed field containing its coefficients This motivates that in applications in physics and engineering a squarefree polynomial is commonly called a polynomial with no repeated root",
			"highlight": "<strong>Square</strong>-free polynomial In mathematics, a <strong>square</strong>-free polynomial is a polynomial defined over a field (or more generally, an integral domain) that does not have as a divisor any <strong>square</strong> of a non-constant polynomial.[1] A univariate polynomial is <strong>square</strong> free if and only if it has no multiple <strong>root</strong> in an algebraically closed field containing its coefficients. This motivates that, in applications in physics and engineering, a <strong>square</strong>-free polynomial is commonly called a polynomial with no repeated <strong>root</strong>",
			"reading_time": 6,
			"date_creation": "2012-01-12",
			"isFavorite": false
		},
		{
			"id": "13029",
			"title": "Penrose method",
			"url": "https://en.wikipedia.org/wiki/Penrose_method",
			"abs": "The Penrose method or squareroot method is a method devised in by Professor Lionel Penrose for allocating the voting weights of delegations possibly a single representative in decisionmaking bodies proportional to the square root of the population represented by this delegation This is justified by the fact that due to the square root law of Penrose the a priori voting power as defined by the PenroseBanzhaf index of a member of a voting body is inversely proportional to the s",
			"highlight": "The Penrose method (or <strong>square</strong>-<strong>root</strong> method) is a method devised in 1946 by Professor Lionel Penrose[1] for allocating the voting weights of delegations (possibly a single representative) in decision-making bodies proportional to the <strong>square</strong> <strong>root</strong> of the population represented by this delegation. This is justified by the fact that, due to the <strong>square</strong> <strong>root</strong> law of Penrose, the a priori voting power (as defined by the Penrose–Banzhaf index) of a member of a voting body is inversely proportional to the s",
			"reading_time": 14,
			"date_creation": "2011-10-05",
			"isFavorite": false
		},
		{
			"id": "19313",
			"title": "Square root of 5",
			"url": "https://en.wikipedia.org/wiki/Square_root_of_5",
			"abs": "Square root of The square root of is the positive real number that when multiplied by itself gives the prime number It is more precisely called the principal square root of to distinguish it from the negative number with the same property This number appears in the fractional expression for the golden ratio It can be denoted in surd form as sqrt It is an irrational algebraic number The first sixty significant digits of its decimal expansion are which ca",
			"highlight": "<strong>Square</strong> <strong>root</strong> of 5 The <strong>square</strong> <strong>root</strong> of 5 is the positive real number that, when multiplied by itself, gives the prime number 5. It is more precisely called the principal <strong>square</strong> <strong>root</strong> of 5, to distinguish it from the negative number with the same property. This number appears in the fractional expression for the golden ratio. It can be denoted in surd form as: <som1>\\sqrt{5}. \\,</som1> It is an irrational algebraic number.[1] The first sixty significant digits of its decimal expansion are: . which ca",
			"reading_time": 5,
			"date_creation": "2018-10-07",
			"isFavorite": false
		},
		{
			"id": "10470",
			"title": "Chi distribution",
			"url": "https://en.wikipedia.org/wiki/Chi_distribution",
			"abs": "Chi distribution In probability theory and statistics the chi distribution is a continuous probability distribution It is the distribution of the positive square root of the sum of squares of a set of independent random variables each following a standard normal distribution or equivalently the distribution of the Euclidean distance of the random variables from the origin It is thus related to the chisquared distribution by describing the distribution of the positive square roots of a vari",
			"highlight": "It is the distribution of the positive <strong>square</strong> <strong>root</strong> of the sum of <strong>squares</strong> of a set of independent random variables each following a standard normal distribution, or equivalently, the distribution of the Euclidean distance of the random variables from the origin. It is thus related to the chi-<strong>squared</strong> distribution by describing the distribution of the positive <strong>square</strong> <strong>roots</strong> of a vari",
			"reading_time": 15,
			"date_creation": "2014-01-12",
			"isFavorite": false
		},
		{
			"id": "11987",
			"title": "Methods of computing square roots",
			"url": "https://en.wikipedia.org/wiki/Methods_of_computing_square_roots",
			"abs": "Methods of computing square roots are numerical analysis algorithms for approximating the principal or nonnegative square root usually denoted sqrtS sqrtS or S of a real number Arithmetically it means given S a procedure for finding a number which when multiplied by itself yields S algebraically it means a procedure for finding the nonnegative root of the equation xS geometrically it",
			"highlight": "Methods of computing <strong>square</strong> <strong>roots</strong> are numerical analysis algorithms for approximating the principal, or non-negative, <strong>square</strong> <strong>root</strong> (usually denoted <som1>\\sqrt{S}</som1>, <som2>\\sqrt[2]{S}</som2>, or <som3>S^{1/2}</som3>) of a real number. Arithmetically, it means given <som4>S</som4>, a procedure for finding a number which when multiplied by itself, yields <som4>S</som4>; algebraically, it means a procedure for finding the non-negative <strong>root</strong> of the equation <som5>x^2-S=0</som5>; geometrically, it",
			"reading_time": 6,
			"date_creation": "2018-12-06",
			"isFavorite": false
		},
		{
			"id": "5064",
			"title": "Principal value",
			"url": "https://en.wikipedia.org/wiki/Principal_value",
			"abs": "In mathematics specifically complex analysis the principal values of a multivalued function are the values along one chosen branch of that function so that it is singlevalued The simplest case arises in taking the square root of a positive real number For example has two square roots and of these the positive root is considered the principal root and is denoted as sqrt Motivation Consider the complex logarithm function logz It is defined as the complex num",
			"highlight": "The simplest case arises in taking the <strong>square</strong> <strong>root</strong> of a positive real number. For example, 4 has two <strong>square</strong> <strong>roots</strong>: 2 and −2; of these the positive <strong>root</strong>, 2, is considered the principal <strong>root</strong> and is denoted as <som1>\\sqrt{4}.</som1> Motivation Consider the complex logarithm function log z. It is defined as the complex num",
			"reading_time": 12,
			"date_creation": "2012-08-14",
			"isFavorite": false
		},
		{
			"id": "15911",
			"title": "Graeffe's method",
			"url": "https://en.wikipedia.org/wiki/Graeffe's_method",
			"abs": "In mathematics Graeffes method or DandelinLobacheskyGraeffe method is an algorithm for finding all of the roots of a polynomial It was developed independently by Germinal Pierre Dandelin in and Lobachevsky in In Karl Heinrich Grffe also discovered the principal idea of the method The method separates the roots of a polynomial by squaring them repeatedly This squaring of the roots is done implicitly that is only working on the coefficients of the polynomial Finally ",
			"highlight": "In mathematics, Graeffe's method or Dandelin–Lobachesky–Graeffe method is an algorithm for finding all of the <strong>roots</strong> of a polynomial. It was developed independently by Germinal Pierre Dandelin in 1826 and Lobachevsky in 1834. In 1837 Karl Heinrich Gräffe also discovered the principal idea of the method.[1] The method separates the <strong>roots</strong> of a polynomial by <strong>squaring</strong> them repeatedly. This <strong>squaring</strong> of the <strong>roots</strong> is done implicitly, that is, only working on the coefficients of the polynomial. Finally,",
			"reading_time": 8,
			"date_creation": "2014-04-27",
			"isFavorite": false
		},
		{
			"id": "15823",
			"title": "Alpha max plus beta min algorithm",
			"url": "https://en.wikipedia.org/wiki/Alpha_max_plus_beta_min_algorithm",
			"abs": "Alpha max plus beta min algorithm The locus of points that give the same value in the algorithm for different values of alpha and beta The alpha max plus beta min algorithm is a highspeed approximation of the square root of the sum of two squares The square root of the sum of two squares also known as Pythagorean addition is a useful function because it finds the hypotenuse of a right triangle given the two side lengths the norm of a D vector or the magnitude z sqrta b",
			"highlight": "Alpha max plus beta min algorithm The locus of points that give the same value in the algorithm, for different values of alpha and beta The alpha max plus beta min algorithm is a high-speed approximation of the <strong>square</strong> <strong>root</strong> of the sum of two <strong>squares</strong>. The <strong>square</strong> <strong>root</strong> of the sum of two <strong>squares</strong>, also known as Pythagorean addition, is a useful function, because it finds the hypotenuse of a right triangle given the two side lengths, the norm of a 2-D vector, or the magnitude <som1>|z| = \\sqrt{a^2 + b^",
			"reading_time": 5,
			"date_creation": "2010-05-16",
			"isFavorite": false
		},
		{
			"id": "25428",
			"title": "Root-raised-cosine filter",
			"url": "https://en.wikipedia.org/wiki/Root-raised-cosine_filter",
			"abs": "Rootraisedcosine filter In signal processing a rootraisedcosine filter RRC sometimes known as squarerootraisedcosine filter SRRC is frequently used as the transmit and receive filter in a digital communication system to perform matched filtering This helps in minimizing intersymbol interference ISI The combined response of two such filters is that of the raisedcosine filter It obtains its name from the fact that its frequency response Hrrcf is the square r",
			"highlight": "<strong>Root</strong>-raised-cosine filter In signal processing, a <strong>root</strong>-raised-cosine filter (RRC), sometimes known as <strong>square</strong>-<strong>root</strong>-raised-cosine filter (SRRC), is frequently used as the transmit and receive filter in a digital communication system to perform matched filtering. This helps in minimizing intersymbol interference (ISI). The combined response of two such filters is that of the raised-cosine filter. It obtains its name from the fact that its frequency response, <som1>H_{rrc}(f)</som1>, is the <strong>square</strong> r",
			"reading_time": 3,
			"date_creation": "2019-02-03",
			"isFavorite": false
		},
		{
			"id": "253",
			"title": "Constructible number",
			"url": "https://en.wikipedia.org/wiki/Constructible_number",
			"abs": "FileSquare root of trianglesvgthumbpxThe square root of square root of is equal to the length of the hypotenuse of a right triangle with legs of length and is therefore a constructible number In geometry and algebra a real number r is constructible if and only if given a line segment of unit length a line segment of length r can be constructed with compass and straightedge in a finite number of steps Equivalently r is constructib",
			"highlight": "[[File:Square <strong>root</strong> of 2 triangle.svg|thumb|250px|The [[<strong>square</strong> <strong>root</strong> of 2|<strong>square</strong> <strong>root</strong> of ]] is equal to the length of the hypotenuse of a right triangle with legs of length and is therefore a constructible number]] In geometry and algebra, a real number <som1>r</som1> is constructible if and only if, given a line segment of unit length, a line segment of length <som2>|r|</som2> can be constructed with compass and straightedge in a finite number of steps. Equivalently, <som1>r</som1> is constructib",
			"reading_time": 10,
			"date_creation": "2020-04-21",
			"isFavorite": false
		},
		{
			"id": "13409",
			"title": "Kato's conjecture",
			"url": "https://en.wikipedia.org/wiki/Kato's_conjecture",
			"abs": "Katos conjecture is a mathematical problem named after mathematician Tosio Kato of the University of California Berkeley Kato initially posed the problem in Kato asked whether the square roots of certain elliptic operators defined via functional calculus are analytic The full statement of the conjecture as given by Auscher et al is the domain of the square root of a uniformly complex elliptic operator L mathrmdiv Anabla with bounded measurable coefficients",
			"highlight": "Kato initially posed the problem in 1953.[1] Kato asked whether the <strong>square</strong> <strong>roots</strong> of certain elliptic operators, defined via functional calculus, are analytic. The full statement of the conjecture as given by Auscher et al. is: \"the domain of the <strong>square</strong> <strong>root</strong> of a uniformly complex elliptic operator <som1>L =-\\mathrm{div} (A\\nabla)</som1> with bounded measurable coefficients",
			"reading_time": 10,
			"date_creation": "2019-03-04",
			"isFavorite": false
		},
		{
			"id": "9740",
			"title": "Solution in radicals",
			"url": "https://en.wikipedia.org/wiki/Solution_in_radicals",
			"abs": "Solution in radicals A solution in radicals or algebraic solution is a closedform expression and more specifically a closedform algebraic expression that is the solution of a polynomial equation and relies only on addition subtraction multiplication division raising to integer powers and the extraction of nth rootth roots square roots cube roots and other integer roots A wellknown example is the solution xfracb pm sqrt bac a of the quadratic equ",
			"highlight": "Solution in radicals A solution in radicals or algebraic solution is a closed-form expression, and more specifically a closed-form algebraic expression, that is the solution of a polynomial equation, and relies only on addition, subtraction, multiplication, division, raising to integer powers, and the extraction of [[nth <strong>root</strong>|th <strong>root</strong>]]s (<strong>square</strong> <strong>roots</strong>, cube <strong>roots</strong>, and other integer <strong>roots</strong>). A well-known example is the solution <som1>x=\\frac{-b \\pm \\sqrt {b^2-4ac\\ }}{2a}</som1> of the quadratic equ",
			"reading_time": 14,
			"date_creation": "2020-05-03",
			"isFavorite": false
		},
		{
			"id": "7473",
			"title": "Gelfond–Schneider constant",
			"url": "https://en.wikipedia.org/wiki/Gelfond–Schneider_constant",
			"abs": "The GelfondSchneider constant or Hilbert number is two to the power of the square root of two which was proved to be a transcendental number by Rodion Kuzmin in In Aleksandr Gelfond and Theodor Schneider independently proved the more general GelfondSchneider theorem which solved the part of Hilberts seventh problem described below Properties The square root of the GelfondSchneider constant is the transcendental number sqrtsqrtsqrtsqrt",
			"highlight": "The Gelfond–Schneider constant or Hilbert number[1] is two to the power of the <strong>square</strong> <strong>root</strong> of two: 2 = ... which was proved to be a transcendental number by Rodion Kuzmin in 1930.[2] In 1934, Aleksandr Gelfond and Theodor Schneider independently proved the more general Gelfond–Schneider theorem,[3] which solved the part of Hilbert's seventh problem described below. Properties The <strong>square</strong> <strong>root</strong> of the Gelfond–Schneider constant is the transcendental number <som1>\\sqrt{2^{\\sqrt{2}}}=\\sqrt{2}^{\\sqrt{",
			"reading_time": 15,
			"date_creation": "2022-02-07",
			"isFavorite": false
		},
		{
			"id": "19185",
			"title": "Kabsch algorithm",
			"url": "https://en.wikipedia.org/wiki/Kabsch_algorithm",
			"abs": "The Kabsch algorithm named after Wolfgang Kabsch is a method for calculating the optimal rotation matrix that minimizes the RMSD root mean squared deviation between two paired sets of points It is useful in graphics cheminformatics to compare molecular structures and also bioinformatics for comparing protein structures in particular see rootmeansquare deviation bioinformatics The algorithm only computes the rotation matrix but it also requires the computation of a translation vec",
			"highlight": "The Kabsch algorithm, named after Wolfgang Kabsch, is a method for calculating the optimal rotation matrix that minimizes the RMSD (<strong>root</strong> mean <strong>squared</strong> deviation) between two paired sets of points. It is useful in graphics, cheminformatics to compare molecular structures, and also bioinformatics for comparing protein structures (in particular, see <strong>root</strong>-mean-<strong>square</strong> deviation (bioinformatics)). The algorithm only computes the rotation matrix, but it also requires the computation of a translation vec",
			"reading_time": 11,
			"date_creation": "2020-11-23",
			"isFavorite": false
		},
		{
			"id": "25099",
			"title": "Reduced chi-squared statistic",
			"url": "https://en.wikipedia.org/wiki/Reduced_chi-squared_statistic",
			"abs": "Reduced chisquared statistic In statistics the reduced chisquare statistic is used extensively in goodness of fit testing It is also known as mean squared weighted deviation MSWD in isotopic dating and variance of unit weight in the context of weighted least squares Its square root is called regression standard error standard error of the regression or standard error of the equation see Ordinary least squaresReduced chisquared Definition It is defined as chisqu",
			"highlight": "Reduced chi-<strong>squared</strong> statistic In statistics, the reduced chi-<strong>square</strong> statistic is used extensively in goodness of fit testing. It is also known as mean <strong>squared</strong> weighted deviation (MSWD) in isotopic dating[1] and variance of unit weight in the context of weighted least <strong>squares</strong>.[2][3] Its <strong>square</strong> <strong>root</strong> is called regression standard error,[4] standard error of the regression,[5][6] or standard error of the equation[7] (see Ordinary least <strong>squares</strong>#Reduced chi-<strong>squared</strong>) Definition It is defined as chi-squ",
			"reading_time": 15,
			"date_creation": "2016-06-18",
			"isFavorite": false
		}
	]
}
